In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                       'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.759239  0.080670
1  bar    one  0.721101  1.018423
2  foo    two -0.156174  1.953276
3  bar  three -0.266004  1.520901
4  foo    two -1.037991  2.056030
5  bar    two -0.490809  0.243293
6  foo    one  0.174507 -0.941579
7  foo  three  0.606521  0.527887

In [5]:
grouped = df.groupby('A')
grouped.first()

       B         C         D
A
bar  one  0.721101  1.018423
foo  one  0.759239  0.080670

In [6]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'
    
grouped = df.groupby(get_letter_type, axis=1)
grouped.first()

  consonant vowel
0       one   foo
1       one   bar
2       two   foo
3     three   bar
4       two   foo
5       two   bar
6       one   foo
7     three   foo

In [7]:
lst = [1,2,3,1,2,3]
s = pd.Series([1,2,3,10,20,30], lst)
grouped = s.groupby(level=0)

In [8]:
grouped.first()

1    1
2    2
3    3
dtype: int64

In [9]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [10]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [12]:
df2 = pd.DataFrame({'X': ['B', 'B', 'A', 'A'], 'Y': [1,2,3,4]})
df2.groupby(['X']).sum()

   Y
X
A  7
B  3

In [13]:
df2.groupby(['X'], sort=False).sum()

   Y
X
B  3
A  7

In [14]:
df3 = pd.DataFrame({'X': ['A', 'B', 'A', 'B'], 'Y': [1,4,3,2]})

In [15]:
df3.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [16]:
df3.groupby(['X']).get_group('B')

   X  Y
1  B  4
3  B  2

In [17]:
df.groupby('A').groups

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [18]:
df.groupby(get_letter_type, axis=1).groups

{'consonant': Index(['B', 'C', 'D'], dtype='object'),
 'vowel': Index(['A'], dtype='object')}

In [19]:
grouped = df.groupby(['A', 'B'])
grouped.groups

{('bar', 'one'): Int64Index([1], dtype='int64'),
 ('bar', 'three'): Int64Index([3], dtype='int64'),
 ('bar', 'two'): Int64Index([5], dtype='int64'),
 ('foo', 'one'): Int64Index([0, 6], dtype='int64'),
 ('foo', 'three'): Int64Index([7], dtype='int64'),
 ('foo', 'two'): Int64Index([2, 4], dtype='int64')}

In [20]:
len(grouped)

6

In [21]:
df

     A      B         C         D
0  foo    one  0.759239  0.080670
1  bar    one  0.721101  1.018423
2  foo    two -0.156174  1.953276
3  bar  three -0.266004  1.520901
4  foo    two -1.037991  2.056030
5  bar    two -0.490809  0.243293
6  foo    one  0.174507 -0.941579
7  foo  three  0.606521  0.527887

In [22]:
gb = df.groupby('B')

In [25]:
gb.sum()

              C         D
B
one    1.654847  0.157513
three  0.340517  2.048787
two   -1.684974  4.252599